In [2]:
import pandas as pd

7.1 数据分析

In [ ]:
df = pd.read_csv('test_table.csv', index_col=0)
df.head() #显示前五行数据

    年龄  牌照
1号  64   2
2号  74   1
3号  25   3
4号  28   5
5号  46   6

In [6]:
#numpy聚合函数均可以在pandas中使用
print(df.mean()) #求平均值
print(df.sum()) #求和
print(df.max()) #求最大值
print(df.min()) #求最小值
print(df.std()) #求标准差
print(df.describe()) #一次性显示所有统计指标
print(df['年龄'].mean()) #求年龄列的平均值
print(df['年龄'].sum()) #求年龄列的和

年龄    45.0
牌照     3.5
dtype: float64
年龄    270
牌照     21
dtype: int64
年龄    74
牌照     6
dtype: int64
年龄    25
牌照     1
dtype: int64
年龄    20.179197
牌照     1.870829
dtype: float64
              年龄        牌照
count   6.000000  6.000000
mean   45.000000  3.500000
std    20.179197  1.870829
min    25.000000  1.000000
25%    29.250000  2.250000
50%    39.500000  3.500000
75%    59.500000  4.750000
max    74.000000  6.000000
45.0
270

In [7]:
#数据透视
df_titanic = pd.read_csv('train.csv')
print(df_titanic.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [ ]:
#一个特征
print(df_titanic.pivot_table('Survived', index='Sex'))#默认aggfunc为mean

        Survived
Sex
female  0.742038
male    0.188908

In [9]:
#两个特征
print(df_titanic.pivot_table('Survived', index='Sex', columns='Pclass'))

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [13]:
#多特征数据透视表
age = pd.cut(df_titanic['Age'], [0, 25, 80])
print(age)
print(df_titanic.pivot_table('Survived', index=['Sex', age], columns='Pclass',observed=False))

0       (0.0, 25.0]
1      (25.0, 80.0]
2      (25.0, 80.0]
3      (25.0, 80.0]
4      (25.0, 80.0]
           ...
886    (25.0, 80.0]
887     (0.0, 25.0]
888             NaN
889    (25.0, 80.0]
890    (25.0, 80.0]
Name: Age, Length: 891, dtype: category
Categories (2, interval[int64, right]): [(0, 25] < (25, 80]]
Pclass                  1         2         3
Sex    Age
female (0, 25]   0.928571  0.965517  0.507692
       (25, 80]  0.982456  0.888889  0.378378
male   (0, 25]   0.500000  0.277778  0.155039
       (25, 80]  0.379310  0.079365  0.145161

In [14]:
#四维数据透视表
fare = pd.qcut(df_titanic['Fare'], 2)
print(fare)
print(df_titanic.pivot_table('Survived', index=['Sex', age], columns=[fare, 'Pclass'], observed=False))

0       (-0.001, 14.454]
1      (14.454, 512.329]
2       (-0.001, 14.454]
3      (14.454, 512.329]
4       (-0.001, 14.454]
             ...
886     (-0.001, 14.454]
887    (14.454, 512.329]
888    (14.454, 512.329]
889    (14.454, 512.329]
890     (-0.001, 14.454]
Name: Fare, Length: 891, dtype: category
Categories (2, interval[float64, right]): [(-0.001, 14.454] < (14.454, 512.329]]
Fare            (-0.001, 14.454]                     (14.454, 512.329]  \
Pclass                         1         2         3                 1
Sex    Age
female (0, 25]               NaN  0.857143  0.589744          0.928571
       (25, 80]              NaN  0.904762  0.444444          0.982456
male   (0, 25]               NaN  0.055556  0.147368          0.500000
       (25, 80]              0.0  0.108108  0.134615          0.397590

Fare
Pclass                  2         3
Sex    Age
female (0, 25]   1.000000  0.384615
       (25, 80]  0.875000  0.315789
male   (0, 25]   0.500000  0.176471
       (25, 80]  0.038462  0.200000